; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_12 ?v3 ?v7)
             (pred_10 ?v11 ?v8)
             (pred_7 ?v3 ?v8)
             (pred_11 ?v6 ?v3 )
	     (pred_8 ?v3)
             (pred_4 ?v12)
             (pred_6 ?v11)
             (pred_5 ?v8)
             (pred_1 ?v3)
             (pred_2 ?v11)
             (pred_9 ?v3)
             (pred_3 ))



(:action op_3
:parameters (?v4 ?v9 ?v1 ?v10)
:precondition (and (pred_4 ?v4) (pred_4 ?v9) (pred_6 ?v1) (pred_5 ?v10)
          (pred_12 ?v4 ?v9) (pred_10 ?v1 ?v10)
                   (pred_7 ?v9 ?v10) (pred_8 ?v4) 
                   (pred_1 ?v9) (pred_2 ?v1))
:effect (and  (pred_9 ?v9) (not (pred_1 ?v9))))


(:action op_1
:parameters (?v4 ?v5)
:precondition (and (pred_4 ?v4) (pred_4 ?v5)
               (pred_8 ?v4) (pred_12 ?v4 ?v5) (pred_9 ?v5))
:effect (and (pred_8 ?v5) (not (pred_8 ?v4))))

(:action op_4
:parameters (?v4 ?v1)
:precondition (and (pred_4 ?v4) (pred_6 ?v1) 
                  (pred_8 ?v4) (pred_11 ?v1 ?v4) (pred_3 ))
:effect (and (pred_2 ?v1)
   (not (pred_11 ?v1 ?v4)) (not (pred_3 ))))


(:action op_2
:parameters (?v4 ?v13 ?v2)
:precondition (and (pred_4 ?v4) (pred_6 ?v13) (pred_6 ?v2)
                  (pred_8 ?v4) (pred_2 ?v2) (pred_11 ?v13 ?v4))
:effect (and (pred_2 ?v13) (pred_11 ?v2 ?v4)
        (not (pred_2 ?v2)) (not (pred_11 ?v13 ?v4))))

(:action op_5
:parameters (?v4 ?v1)
:precondition (and (pred_4 ?v4) (pred_6 ?v1) 
                  (pred_8 ?v4) (pred_2 ?v1))
:effect (and (pred_3 ) (pred_11 ?v1 ?v4) (not (pred_2 ?v1)))))

; problem
(define (problem grid-4-4-2-3-3)
    (:domain grid)
    (:objects
    obj_10 obj_07 obj_18 obj_14 obj_21 obj_16 obj_05 obj_11 obj_15 obj_19 obj_13 obj_20 obj_09 obj_01 obj_06 obj_17
    obj_03 obj_12
    obj_04 obj_08 obj_02
    )

    (:init
       (pred_3)

       (pred_4 obj_10)
       (pred_4 obj_07)
       (pred_4 obj_18)
       (pred_4 obj_14)
       (pred_4 obj_21)
       (pred_4 obj_16)
       (pred_4 obj_05)
       (pred_4 obj_11)
       (pred_4 obj_15)
       (pred_4 obj_19)
       (pred_4 obj_13)
       (pred_4 obj_20)
       (pred_4 obj_09)
       (pred_4 obj_01)
       (pred_4 obj_06)
       (pred_4 obj_17)
       (pred_5 obj_03)
       (pred_5 obj_12)
       (pred_6 obj_04)
       (pred_6 obj_08)
       (pred_6 obj_02)

       (pred_12 obj_10 obj_21)
       (pred_12 obj_10 obj_07)
       (pred_12 obj_07 obj_16)
       (pred_12 obj_07 obj_18)
       (pred_12 obj_07 obj_10)
       (pred_12 obj_18 obj_05)
       (pred_12 obj_18 obj_14)
       (pred_12 obj_18 obj_07)
       (pred_12 obj_14 obj_11)
       (pred_12 obj_14 obj_18)
       (pred_12 obj_21 obj_15)
       (pred_12 obj_21 obj_16)
       (pred_12 obj_21 obj_10)
       (pred_12 obj_16 obj_19)
       (pred_12 obj_16 obj_05)
       (pred_12 obj_16 obj_07)
       (pred_12 obj_16 obj_21)
       (pred_12 obj_05 obj_13)
       (pred_12 obj_05 obj_11)
       (pred_12 obj_05 obj_18)
       (pred_12 obj_05 obj_16)
       (pred_12 obj_11 obj_20)
       (pred_12 obj_11 obj_14)
       (pred_12 obj_11 obj_05)
       (pred_12 obj_15 obj_09)
       (pred_12 obj_15 obj_19)
       (pred_12 obj_15 obj_21)
       (pred_12 obj_19 obj_01)
       (pred_12 obj_19 obj_13)
       (pred_12 obj_19 obj_16)
       (pred_12 obj_19 obj_15)
       (pred_12 obj_13 obj_06)
       (pred_12 obj_13 obj_20)
       (pred_12 obj_13 obj_05)
       (pred_12 obj_13 obj_19)
       (pred_12 obj_20 obj_17)
       (pred_12 obj_20 obj_11)
       (pred_12 obj_20 obj_13)
       (pred_12 obj_09 obj_01)
       (pred_12 obj_09 obj_15)
       (pred_12 obj_01 obj_06)
       (pred_12 obj_01 obj_19)
       (pred_12 obj_01 obj_09)
       (pred_12 obj_06 obj_17)
       (pred_12 obj_06 obj_13)
       (pred_12 obj_06 obj_01)
       (pred_12 obj_17 obj_20)
       (pred_12 obj_17 obj_06)
       (pred_1 obj_20)
       (pred_1 obj_16)
       (pred_1 obj_17)
       (pred_7  obj_20 obj_03)
       (pred_7  obj_16 obj_12)
       (pred_7  obj_17 obj_12)
       (pred_9 obj_10)
       (pred_9 obj_07)
       (pred_9 obj_18)
       (pred_9 obj_14)
       (pred_9 obj_21)
       (pred_9 obj_05)
       (pred_9 obj_11)
       (pred_9 obj_15)
       (pred_9 obj_19)
       (pred_9 obj_13)
       (pred_9 obj_09)
       (pred_9 obj_01)
       (pred_9 obj_06)

       (pred_10  obj_04 obj_03)
       (pred_10  obj_08 obj_12)
       (pred_10  obj_02 obj_12)
       (pred_11 obj_04 obj_11)
       (pred_11 obj_08 obj_01)
       (pred_11 obj_02 obj_10)
       (pred_8 obj_13)
    )

    (:goal (and
       (pred_11 obj_04 obj_20)
    ))
(:constraints
  (always (not (pred_8 obj_05)))
)
)

; plan
1. (op_1 obj_13 obj_19)
   deleted: (pred_8 obj_13)
   added: (pred_8 obj_19)
   goals met: 0 of 1
2. (op_1 obj_19 obj_15)
   deleted: (pred_8 obj_19)
   added: (pred_8 obj_15)
   goals met: 0 of 1
3. (op_1 obj_15 obj_21)
   deleted: (pred_8 obj_15)
   added: (pred_8 obj_21)
   goals met: 0 of 1
4. (op_1 obj_21 obj_10)
   deleted: (pred_8 obj_21)
   added: (pred_8 obj_10)
   goals met: 0 of 1
5. (op_1 obj_10 obj_07)
   deleted: (pred_8 obj_10)
   added: (pred_8 obj_07)
   goals met: 0 of 1
6. (op_1 obj_07 obj_18)
   deleted: (pred_8 obj_07)
   added: (pred_8 obj_18)
   goals met: 0 of 1
7. (op_1 obj_18 obj_14)
   deleted: (pred_8 obj_18)
   added: (pred_8 obj_14)
   goals met: 0 of 1
8. (op_1 obj_14 obj_11)
   deleted: (pred_8 obj_14)
   added: (pred_8 obj_11)
   goals met: 0 of 1
9. (op_4 obj_11 obj_04)
   deleted: (pred_11 obj_04 obj_11) (pred_3)
   added: (pred_2 obj_04)
   goals met: 0 of 1
10. (op_3 obj_11 obj_20 obj_04 obj_03)
   deleted: (pred_1 obj_20)
   added: (pred_9 obj_20)
   goals met: 0 of 1
11. (op_1 obj_11 obj_20)
   deleted: (pred_8 obj_11)
   added: (pred_8 obj_20)
   goals met: 0 of 1
12. (op_5 obj_20 obj_04)
   deleted: (pred_2 obj_04)
   added: (pred_3) (pred_11 obj_04 obj_20)
   goals met: 1 of 1
